import React, { Component } from 'react';

import 'bootstrap/dist/css/bootstrap.min.css';
import { Nav, Navbar, Form } from 'react-bootstrap';
import Button from '@material-ui/core/Button';

import "./css/index.css";
import "./css/text-draw.css";

import Slider from "react-slick";
import "./css/slick.css";
import "./css/slick-theme.css";

import phoneimg from "./svg/phone.svg";

class Home extends Component {
    goBack = () => {
        this.props.history.goBack();
    }
    render() {
        const settings = {
            dots: false,
            infinite: true,
            speed: 1000,
            slidesToShow: 1,
            slidesToScroll: 1,
            autoplay: true,
            autoplaySpeed: 3000,
        };
        return (
            <div className="hi-body">
                <Navbar bg="light" variant="light">
                    <Navbar.Brand href="/">Sillock</Navbar.Brand>
                    <Nav className="mr-auto">
                        <Nav.Link href="/">홈</Nav.Link>
                        <Nav.Link href="/user/profile/mysillock">내 지갑</Nav.Link>
                    </Nav>
                    <Form inline>
                        <Button variant="outline-primary" onClick={(e) => { this.goBack() }}>뒤로가기 </Button>
                    </Form>
                </Navbar>

                <div className="wave-container">
                    <svg id="wave-area" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
                        <path fill="#9733ee" fill-opacity="1"
                            d="M0,128L48,154.7C96,181,192,235,288,256C384,277,480,267,576,234.7C672,203,768,149,864,133.3C960,117,1056,139,1152,144C1248,149,1344,139,1392,133.3L1440,128L1440,0L1392,0C1344,0,1248,0,1152,0C1056,0,960,0,864,0C768,0,672,0,576,0C480,0,384,0,288,0C192,0,96,0,48,0L0,0Z">
                        </path>
                    </svg>
                </div>

                <div class="row h-100">
                    <div class="col-sm-12 my-auto">
                        <div className="container-fluid hi-container-fluid">
                            {/* Content here */}
                            <div>
                                <Slider {...settings} className="text-center">
                                    <div>
                                        <svg id="logo" className="text-center pt-3" width="450" height="109" viewBox="0 0 552 109" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <path
                                                d="M37.704 105.672C31.08 105.672 25.128 104.52 19.848 102.216C14.664 99.816 10.584 96.552 7.608 92.424C4.632 88.2 3.096 83.352 3 77.88H16.968C17.448 82.584 19.368 86.568 22.728 89.832C26.184 93 31.176 94.584 37.704 94.584C43.944 94.584 48.84 93.048 52.392 89.976C56.04 86.808 57.864 82.776 57.864 77.88C57.864 74.04 56.808 70.92 54.696 68.52C52.584 66.12 49.944 64.296 46.776 63.048C43.608 61.8 39.336 60.456 33.96 59.016C27.336 57.288 22.008 55.56 17.976 53.832C14.04 52.104 10.632 49.416 7.752 45.768C4.968 42.024 3.576 37.032 3.576 30.792C3.576 25.32 4.968 20.472 7.752 16.248C10.536 12.024 14.424 8.76 19.416 6.456C24.504 4.152 30.312 3 36.84 3C46.248 3 53.928 5.352 59.88 10.056C65.928 14.76 69.336 21 70.104 28.776H55.704C55.224 24.936 53.208 21.576 49.656 18.696C46.104 15.72 41.4 14.232 35.544 14.232C30.072 14.232 25.608 15.672 22.152 18.552C18.696 21.336 16.968 25.272 16.968 30.36C16.968 34.008 17.976 36.984 19.992 39.288C22.104 41.592 24.648 43.368 27.624 44.616C30.696 45.768 34.968 47.112 40.44 48.648C47.064 50.472 52.392 52.296 56.424 54.12C60.456 55.848 63.912 58.584 66.792 62.328C69.672 65.976 71.112 70.968 71.112 77.304C71.112 82.2 69.816 86.808 67.224 91.128C64.632 95.448 60.792 98.952 55.704 101.64C50.616 104.328 44.616 105.672 37.704 105.672Z"
                                                stroke="#9733ee" stroke-width="5" />
                                            <path d="M103.5 4.296V104.664H90.3956V4.296H103.5Z" stroke="#9733ee" stroke-width="5" />
                                            <path d="M138.937 94.008H174.073V104.664H125.833V4.296H138.937V94.008Z" stroke="#9733ee"
                                                stroke-width="5" />
                                            <path d="M201.093 94.008H236.229V104.664H187.989V4.296H201.093V94.008Z" stroke="#9733ee"
                                                stroke-width="5" />
                                            <path
                                                d="M295.65 105.672C286.338 105.672 277.842 103.512 270.162 99.192C262.482 94.776 256.386 88.68 251.874 80.904C247.458 73.032 245.25 64.2 245.25 54.408C245.25 44.616 247.458 35.832 251.874 28.056C256.386 20.184 262.482 14.088 270.162 9.768C277.842 5.352 286.338 3.144 295.65 3.144C305.058 3.144 313.602 5.352 321.282 9.768C328.962 14.088 335.01 20.136 339.426 27.912C343.842 35.688 346.05 44.52 346.05 54.408C346.05 64.296 343.842 73.128 339.426 80.904C335.01 88.68 328.962 94.776 321.282 99.192C313.602 103.512 305.058 105.672 295.65 105.672ZM295.65 94.296C302.658 94.296 308.946 92.664 314.514 89.4C320.178 86.136 324.594 81.48 327.762 75.432C331.026 69.384 332.658 62.376 332.658 54.408C332.658 46.344 331.026 39.336 327.762 33.384C324.594 27.336 320.226 22.68 314.658 19.416C309.09 16.152 302.754 14.52 295.65 14.52C288.546 14.52 282.21 16.152 276.642 19.416C271.074 22.68 266.658 27.336 263.394 33.384C260.226 39.336 258.642 46.344 258.642 54.408C258.642 62.376 260.226 69.384 263.394 75.432C266.658 81.48 271.074 86.136 276.642 89.4C282.306 92.664 288.642 94.296 295.65 94.296Z"
                                                stroke="#9733ee" stroke-width="5" />
                                            <path
                                                d="M358.453 54.408C358.453 44.616 360.661 35.832 365.077 28.056C369.493 20.184 375.493 14.04 383.077 9.624C390.757 5.208 399.253 3 408.565 3C419.509 3 429.061 5.64 437.221 10.92C445.381 16.2 451.333 23.688 455.077 33.384H439.381C436.597 27.336 432.565 22.68 427.285 19.416C422.101 16.152 415.861 14.52 408.565 14.52C401.557 14.52 395.269 16.152 389.701 19.416C384.133 22.68 379.765 27.336 376.597 33.384C373.429 39.336 371.845 46.344 371.845 54.408C371.845 62.376 373.429 69.384 376.597 75.432C379.765 81.384 384.133 85.992 389.701 89.256C395.269 92.52 401.557 94.152 408.565 94.152C415.861 94.152 422.101 92.568 427.285 89.4C432.565 86.136 436.597 81.48 439.381 75.432H455.077C451.333 85.032 445.381 92.472 437.221 97.752C429.061 102.936 419.509 105.528 408.565 105.528C399.253 105.528 390.757 103.368 383.077 99.048C375.493 94.632 369.493 88.536 365.077 80.76C360.661 72.984 358.453 64.2 358.453 54.408Z"
                                                stroke="#9733ee" stroke-width="5" />
                                            <path
                                                d="M529.015 104.664L487.687 58.872V104.664H474.583V4.296H487.687V50.808L529.159 4.296H545.719L500.215 54.552L546.151 104.664H529.015Z"
                                                stroke="#9733ee" stroke-width="5" />
                                        </svg>
                                    </div>
                                    <div>
                                        <div class="card-body">
                                            <h1 class="card-title">실록이란?</h1>
                                            <h3 class="card-text">사실을 있는 그대로 적은 기록이라는 뜻을 가진<br></br>블록체인 기반 자기주권이력증명서비스 플랫폼입니다.</h3>
                                        </div>
                                    </div>
                                    <div>
                                        {/* img */}
                                        <div class="card-body">
                                            <h1>WHY 실록?</h1>
                                            <h3>실록은 블록체인 기반으로 설계되어 있어,<br></br>보다 안전하고 신뢰성 있는 서비스를 제공합니다.</h3>
                                        </div>
                                    </div>
                                    <div>
                                        {/* img */}
                                        <div class="card-body text-center">
                                            <h2>손쉬운 이력 증명이 가능하도록,<br></br>실록이 함께 하겠습니다.</h2>
                                        </div>
                                    </div>
                                    <div>
                                        <div class="card-body text-center">
                                            <h2>나만의 증명 지갑을 통한 간편한 이력 관리</h2>
                                            <h5>'my 실록 지갑'  서비스를 통해 여러 인증 기관의<br></br> 이력들을 한 눈에 확인하실 수 있습니다.</h5>
                                        </div>
                                    </div>
                                    <div>
                                        <div class="card-body text-center">
                                            <h2>증명서의 개인 정보 공개 범위 설정이 가능</h2>
                                            <h5>나만의 증명서 조합하기' 기능을 이용해<br></br>인증서 내의 공개 정보 범위를 선택하실 수 있습니다!</h5>
                                        </div>
                                    </div>
                                    <div>
                                        <div class="card-body text-center">
                                            <h2>자격 이력 검증 자동화 시스템 지원</h2>
                                        </div>
                                    </div>
                                </Slider>
                            </div>
                        </div>
                    </div>
                </div>

                <footer className="footer shadow-lg">
                    <strong>@ 2020</strong>
                </footer>
            </div>
        );
    }
}

export default Home;